---
kind: property
id: P:Autodesk.Revit.DB.RelinquishOptions.ViewWorksets
source: html/1ecc9687-31c2-5b2f-b604-4b73f1c52d38.htm
---
# Autodesk.Revit.DB.RelinquishOptions.ViewWorksets Property

True means all view worksets owned by the current user should be relinquished.
 False means none of these are relinquished.

## Syntax (C#)
```csharp
public bool ViewWorksets { get; set; }
```